import React from 'react'
import './Explain.css'

interface expProp {
    trigger: () => void
}

export default function Explain({trigger}:expProp) {
  return (
    <div className='explain-container'>
        <h1>راهنمای آزمون</h1>
        <p>بیا وانمود کنیم در یک کشور دیگری هستی که مردمش به زبان متفاوتی صحبت میکنند.  فرض کن در این آزمون، تعدادی کلمه از این زبان به تو داده می‌شوند؛ این کلمات می توانند اسم، فعل و ... باشند. کار تواین است که معنای این کلمات را کشف کنی و حدس بزنی.</p>
        <p>چطور باید این کار را بکنی؟</p>
        <p>در هر مرحله، یک جملۀ راهنما به تو داده می‌شود. این جمله به تو کمک می‌کند کشف کنی کلمۀ مورد نظر به چه معناست.</p>
        <p>بعد از اینکه اولین جمله را دیدی، باید حدس بزنی کلمۀ مورد نظر به چه معناست، حتی اگر جملۀ راهنما زیاد برایت کمک کننده نبوده است. اگر حدس تو درست نباشد، جملۀ راهنمای بعدی ظاهر می‌شود و باید حدس دیگری بزنی. هر جمله ای که نشان داده می‌شود، کمک بیشتری به تو خواهد کرد.</p>
        <p>این آزمون به تو نمی‌گوید که حدس‌هایت درست است یا اشتباه. پس اگر  بعد از چند جمله اول فکر می کنی جوابت درست است و این جواب با جملات راهنمای بعدی هم جور درمی‌آید، به دادن همان جواب ادامه بده. اگر نه، می توانی جوابت را بعد از هر  جمله تغییر دهی.</p>
        <p>حتی اگر هیچ چیزی به ذهنت نمی‌رسد، لازم است حدسی بزنی وگرنه آزمون به مرحلۀ بعد نخواهد رفت.</p>
        <span>
        <button className='btn' onClick={trigger}>شروع مرحله تمرینی</button>
        </span>
    </div>
  )
}
